---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLineWeight
source: html/b62db3ad-64fd-7dc8-6e31-355894b90f92.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLineWeight Property

The projection surface line weight.

## Syntax (C#)
```csharp
public int ProjectionLineWeight { get; }
```